driver-tests/bpelse/JavaEEIntegration/DirectElem/DirectElemJBI/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:someNS="http://xml.netbeans.org/schema/DirectElemSchema">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <someNS:MsgElem xmlns:someNS="http://xml.netbeans.org/schema/DirectElemSchema">
    <intElem>201</intElem>
    <strElem>BC Sending Msg: Sending Msg to JavaEE from BPEL: Added in the JavaEE SE and EJB: Received Msg From JavaEE:</strElem>
  </someNS:MsgElem>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
